<template>
  <auth-page-layout :show-links="false">
    <legal-form
      :title="
        $t('Terms of use of the LightTown website, resources and services')
      "
      :desc="$t('Welcom to LightTown Platform')"
    >
      <legal-group-item-form>
        Администрация Сайтов и Сервисов LightTown (далее - “Администрация”)
        предоставляют возможность воспользоваться Сайтами и Сервисами в
        соответствии с условиями настоящих Правил пользования Сайтами и
        Сервисами (далее – «настоящие Правила»).
      </legal-group-item-form>
      <legal-group-item-form>
        Уведомляем Вас, что доступ к Сайтам и Сервисам LightTown (далее
        совместно - Площадки) и их использование возможно исключительно при
        соблюдении нижеприведенных условий. В случае несогласия с настоящими
        Правилами просим вас прекратить пользование Площадками Администрации.
        Настоящие Правила являются публичной офертой согласно статье 437
        Гражданского кодекса Российской Федерации и определяют условия
        использования и функционирования Площадок, а также обязанности их
        Пользователей и Администрации Площадок. Настоящие Правила распространяют
        свое действие также на отношения, касающиеся прав и законных интересов
        третьих лиц, которые не являются Пользователями Площадок, но чьи права и
        законные интересы могут быть затронуты в результате деяний (действия
        и/или бездействия) Пользователей Площадок.
      </legal-group-item-form>
      <legal-group-form title="1. Термины и определения">
        <legal-group-item-form>
          1.1. Сайты и Сервисы (Площадки) - веб-сайты, а также расположенные на
          них сервисы, принадлежащие Администрации, размещенные в сети Интернет
          по следующим адресам: www.light-town.space, light-town.space.
        </legal-group-item-form>
        <legal-group-item-form>
          1.2. Пользователь / Посетитель - лицо, осуществляющее непосредственный
          доступ (использующее Площадку любым способом, в том числе путем
          посещения Площадок) к Площадке через Интернет или иным другим
          способом, дееспособное для акцепта Правил.
        </legal-group-item-form>
        <legal-group-item-form>
          1.3. Аутентификационные данные — уникальные логин и пароль
          Пользователя Площадки, используемые для доступа к Личному кабинету из
          сети Интернет или доступа к соответствующим разделам Площадки,
          предоставляющие возможность использовать ресурсы и сервисы Площадки.
          персональных данных.
        </legal-group-item-form>
        <legal-group-item-form>
          1.4. Личный кабинет - персонализированный раздел веб-сайта reg.ru,
          закрытый для публичного доступа, посредством которого Пользователь и
          Администрация обмениваются юридически и технически значимой
          информацией, касающейся исполнения заключенных договоров. Доступ к
          Личному Кабинету осуществляется посредством ввода на странице входа
          аутентификационных данных логина (имени пользователя) и пароля (кода
          доступа). Указанные в настоящем пункте аутентификационные данные по
          смыслу настоящего договора и действующего законодательства являются
          простой электронной подписью.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form
        title="2. Порядок регистрации пользователей на площадках"
      >
        <legal-group-item-form>
          2.1. Регистрация Пользователя на Площадках является добровольной. В
          зависимости от типа заказываемых услуг Администрация или Партнер могут
          попросить предоставить дополнительные данные, необходимые для оказания
          услуг по заключаемому гражданско-правовому договору.
        </legal-group-item-form>
        <legal-group-item-form>
          2.2. При регистрации на Площадках Пользователь обязан предоставить
          Администрации достоверную и актуальную информацию. Пользователь дает
          свое согласие на обработку Администрацией (Партнеру) его персональных
          данных, предоставленных при регистрации, в целях оказания услуг по
          соответствующему клиентскому договору.
        </legal-group-item-form>
        <legal-group-item-form>
          2.3. Пользователь несет полную ответственность за сохранность пароля к
          своему Личному кабинету и самостоятельно несет ответственность за
          действия третьих лиц, которым он сообщил данные своей учетной записи.
          Администрация не отвечает за любую потерю или порчу данных
          Пользователя, произошедшую в связи с несанкционированным доступом к
          его странице третьих лиц.
        </legal-group-item-form>
        <legal-group-item-form>
          2.4. При доступе Пользователя к Площадке на компьютер могут быть
          записаны файлы cookies, которые в дальнейшем будут использованы для
          автоматической авторизации Пользователя на Площадках, а также для
          сбора статистических данных. Администрация вправе направлять
          Пользователям информационные сообщения.
        </legal-group-item-form>
        <legal-group-item-form>
          2.5. Администрация вправе, руководствуясь правила обслуживания,
          ограничивать использование отдельных сервисов Площадки для всех или
          отдельных категорий Пользователей, ограничить размещение определенной
          информации, любого другого контента.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form
        title="3. Права и обязанности пользователя и администрации"
      >
        <legal-group-item-form>
          3.1. Используя ресурсы и сервисы Площадок, Пользователь Площадок
          обязуется:
        </legal-group-item-form>
        <legal-group-item-form>
          - соблюдать положения действующего законодательства Российской
          Федерации, настоящих Правил и иных имеющих правовой характер
          документов Администрации;
        </legal-group-item-form>
        <legal-group-item-form>
          - предоставлять при регистрации достоверные, полные и актуальные
          данные, следить за их актуализацией;
        </legal-group-item-form>
        <legal-group-item-form>
          - информировать Администрацию о несанкционированном доступе к Личному
          кабинету и/или о несанкционированном доступе и/или использовании
          пароля и логина Пользователя; - не предоставлять доступ другим
          Пользователям к собственной Личному кабинету или к отдельной
          содержащейся на ней информации в случае, если это может привести к
          нарушению действующего законодательства Российской Федерации и/или
          настоящих Правил, иных правовых актов Администрации;
        </legal-group-item-form>
        <legal-group-item-form>
          - не использовать программное обеспечение и осуществлять действия,
          направленные на нарушение нормального функционирования Площадок и его
          сервисов или персональных страниц Пользователей Площадок;
        </legal-group-item-form>
        <legal-group-item-form>
          - не осуществлять массовые рассылки сообщений без согласия
          Пользователей Площадок;
        </legal-group-item-form>
        <legal-group-item-form>
          - не использовать без специального на то разрешения Администрации
          автоматизированные скрипты (программы) для сбора информации на
          Площадках и/или) взаимодействия с Площадкой и его сервисами;
        </legal-group-item-form>
        <legal-group-item-form>
          - любым способом, например, путем обмана, злоупотребления доверием,
          взлома и прочее, не пытаться получить доступ к логину и паролю других
          Пользователей Площадки;
        </legal-group-item-form>
        <legal-group-item-form>
          3.2. Администрация Площадок вправе изменять (модерировать) или удалять
          любую публикуемую Пользователем информацию, в любое время по любой
          причине или без объяснения причин, с предварительным уведомлением
          Пользователей или без такового, в случае, если такая информация
          нарушает условия обслуживания, указанные в соответствующих документах
          Администрации.
        </legal-group-item-form>
        <legal-group-item-form>
          3.3. Администрация Площадки сохраняет за собой право в любое время
          изменять оформление Площадок, его содержание, список сервисов,
          программное обеспечение с предварительным уведомлением Пользователей
          или без такового;
        </legal-group-item-form>
        <legal-group-item-form>
          3.4. Администрация не занимается предварительной модерацией или
          цензурой информации Пользователей Площадки и предпринимает действия по
          защите прав и законных интересов физических или юридических лиц и
          обеспечению соблюдения требований действующего законодательства
          Российской Федерации только после обращения заинтересованного лица к
          Администрации в установленном порядке.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form title="4. Исключительные права">
        <legal-group-item-form>
          4.1. Все объекты, размещенные на Площадках (элементы дизайна, текст,
          графические изображения, иллюстрации, видео, программы для ЭВМ, базы
          данных, музыка, звуки и другие объекты), в том числе элементы дизайна
          Площадок (далее - Контент), являются объектами исключительных прав
          Администрации, все права на эти объекты защищены, если только иное не
          указано или не воспринимается любым другим образом как права третьих
          лиц. Любое несанкционированное использование таких товарных знаков или
          других материалов категорически запрещено и является нарушением
          авторских прав, закона о товарных знаках или других прав на
          промышленную собственность
        </legal-group-item-form>
        <legal-group-item-form>
          4.2. Никакие материалы не могут быть скопированы (воспроизведены),
          переработаны, распространены, опубликованы, скачаны, переданы, проданы
          или иным способом использованы целиком или по частям без
          предварительного разрешения правообладателя, кроме случаев, когда
          правообладатель явным образом выразил свое согласие на свободное
          использование таких материалов любым лицом. Использование контента, а
          также каких-либо иных элементов сервисов возможно только в рамках
          функционала, предлагаемого тем или иным сервисом. Использование
          Пользователем элементов содержания сервисов, а также любого контента
          для личного некоммерческого использования, допускается при условии
          сохранения всех знаков охраны авторского права, смежных прав, товарных
          знаков, других уведомлений об авторстве, сохранения имени (или
          псевдонима) автора/наименования правообладателя в неизменном виде,
          сохранении соответствующего объекта в неизменном виде. Исключение
          составляют случаи, прямо предусмотренные законодательством РФ.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form title="5. Прочие положения">
        <legal-group-item-form>
          5.1. Ничто в Правилах не может пониматься как установление между
          Пользователем и Администрацией агентских отношений, отношений
          товарищества, отношений по совместной деятельности, отношений личного
          найма, либо каких-то иных отношений, прямо непоименованных в Правилах.
        </legal-group-item-form>
        <legal-group-item-form>
          5.2. Настоящие Правила регулируются и толкуются в соответствии с
          законодательством Российской Федерации. Вопросы, не урегулированные
          Правилами, подлежат разрешению в соответствии с законодательством
          Российской Федерации
        </legal-group-item-form>
        <legal-group-item-form>
          5.3. Все споры, проистекающие из правоотношений, регулируемых
          настоящими Правилами разрешаются путём переговоров, а при недостижении
          согласия передаются на рассмотрение в Арбитражный суд города Москвы.
        </legal-group-item-form>
        <legal-group-item-form>
          5.4. Настоящие Правила вступают в силу для Пользователя с момента его
          присоединения к ним и действуют в течение неопределенного срока.
        </legal-group-item-form>
      </legal-group-form>
    </legal-form>
  </auth-page-layout>
</template>

<script>
import AuthPageLayout from '~/layouts/auth/index.vue';
import LegalForm from '~/components/forms/legal/index.vue';
import LegalGroupForm from '~/components/forms/legal/group.vue';
import LegalGroupItemForm from '~/components/forms/legal/group-item.vue';

export default {
  name: 'TermsOfServicePage',
  components: {
    AuthPageLayout,
    LegalForm,
    LegalGroupForm,
    LegalGroupItemForm,
  },
};
</script>

<style lang="scss" src="./index.scss"></style>
