<template>
  <auth-page-layout :show-links="false">
    <legal-form
      :title="$t('LightTown Privacy Policy')"
      :desc="$t('Welcom to LightTown Platform')"
    >
      <legal-group-form title="1. ОБЩИЕ ПОЛОЖЕНИЯ">
        <legal-group-item-form>
          1.1. Настоящая Политика проводится LightTown (далее — «Организация») в
          отношении обработки и обеспечения защиты персональных данных
          физических лиц (субъектов персональных данных, далее — «Субъект»,
          «Клиент») на основании статьи 24 Конституции РФ и Федерального закона
          N 152-ФЗ «О персональных данных».
        </legal-group-item-form>
        <legal-group-item-form>
          1.2. Политика применяется в отношении всех персональных данных,
          которые могут быть получены Организацией в процессе деятельности, в
          том числе от клиентов Организации. Обработка персональных данных в
          Организации осуществляется в соответствии с применимыми законами и
          нормативно-правовыми актами в Российской Федерации, касающимися
          обработки персональных данных, в частности, но не ограничиваясь:
          Федеральный закон от 27 июля 2006 г. № 152-ФЗ «О персональных данных»
          (далее – Федеральный закон «О персональных данных»); Федеральный закон
          «О связи» от 07.07.2003 N 126-ФЗ; Федеральный закон «Об информации,
          информационных технологиях и о защите информации» от 27.07.2006 N
          149-ФЗ и т.д.
        </legal-group-item-form>
        <legal-group-item-form>
          1.3. Цель Политики заключается в доведении до лиц, предоставляющих
          свои персональные данные, необходимой информации, позволяющей оценить,
          какие персональные данные и с какими целями обрабатываются
          Организацией, какие методы обеспечения их безопасности реализуются, а
          также установление основных принципов и подходов к обработке и
          обеспечению безопасности персональных данных в Организации.
        </legal-group-item-form>
        <legal-group-item-form>
          1.4. Политика обеспечивает защиту прав и свобод субъектов при
          обработке их персональных данных с использованием средств
          автоматизации или без использования таких средств, а также
          устанавливает ответственность лиц, имеющих доступ к персональным
          данным, за невыполнение требований, регулирующих обработку и защиту
          персональных данных.
        </legal-group-item-form>
        <legal-group-item-form>
          1.5. Пользователи, используя сервисы и услуги Организации, сервисы и
          услуги, размещенные на веб-сайте Организации www.light-town.space
          (далее — «Сайт»), сообщив Организации свои персональные данные, в том
          числе при посредничестве третьих лиц, признают своё согласие на
          обработку персональных данных в соответствии с настоящей Политикой. В
          случае несогласия с настоящей Политикой в целом, как и в случае
          несогласия с каким-либо пунктом настоящей Политики, Пользователь
          должен воздержаться от использования Сервисов.
        </legal-group-item-form>
        <legal-group-item-form>
          1.5.1. Организация получает и начинает обработку персональных данных
          Субъекта с момента получения его согласия. Согласие на обработку
          персональных данных может быть дано Субъектом персональных данных в
          любой форме, позволяющей подтвердить факт получения согласия, если
          иное не установлено федеральным законом: в письменной, устной или иной
          форме, предусмотренной действующим законодательством, в том числе
          посредством совершения Субъектом персональных данных конклюдентных
          действий при использовании сервисов на веб-сайте Организации
          www.light-town.space, использовании форм обратной связи и акцепте
          оферт, содержащих в себе положения об обработке персональных данных в
          соответствии с действующим законодательством. В случае отсутствия
          согласия Субъекта персональных данных на обработку его персональных
          данных, такая обработка не осуществляется.
        </legal-group-item-form>
        <legal-group-item-form>
          1.6. Согласие на обработку персональных данных может быть отозвано
          субъектом персональных данных. В случае отзыва субъектом персональных
          данных согласия на обработку персональных данных оператор вправе
          продолжить обработку персональных данных без согласия субъекта
          персональных данных при наличии оснований, указанных действующим
          законодательством.
        </legal-group-item-form>
        <legal-group-item-form>
          1.7. Настоящая Политика может быть изменена Организацией. Организация
          имеет право в любое время по своему собственному усмотрению вносить
          изменения в настоящую Политику без предварительного уведомления
          Пользователя об этом. При внесении изменений в актуальной редакции
          указывается дата последнего обновления. Новая редакция Политики
          вступает в силу с момента ее размещения на Сайте, если иное не
          предусмотрено новой редакцией Политики.
        </legal-group-item-form>
        <legal-group-item-form>
          1.8. Настоящая Политика применима только к информации о Пользователе,
          получаемой в ходе использования Сервисов Организации. Организация не
          контролирует и не несет ответственности за обработку информации о
          Пользователе веб-сайтами третьих лиц, на которые Пользователь может
          перейти по ссылкам, доступным на официальном веб-сервере Организации.
        </legal-group-item-form>
        <legal-group-item-form>
          1.9. При предоставлении услуг, в том числе в случаях обращения
          Пользователя в службу поддержки, Оператор может осуществлять
          трансграничную передачу персональных данных исключительно с целью
          учета обращений и анализа статистики, при этом такая передача
          осуществляется с использованием баз данных, находящихся на территории
          Российской Федерации.. Хранение персональных данных осуществляется
          только на территории Российской Федерации. Пользователь дает свое
          согласие Оператору на такую трансграничную передачу данных в целях
          учета обращений и анализа статистики, указанных в настоящем пункте.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form title="2. ПОНЯТИЕ И СОСТАВ ПЕРСОНАЛЬНЫХ ДАННЫХ">
        <legal-group-item-form>
          2.1. В целях настоящей Политики под персональными данными понимается
          любая информация, относящаяся к прямо или косвенно определенному
          физическому лицу (субъекту персональных данных).
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form
        title="3. ОСНОВАНИЯ, ПРИНЦИПЫ И ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ"
      >
        <legal-group-item-form>
          3.1. Организация обрабатывает персональные данные для осуществления
          своей деятельности, в том числе для оказания Клиентам услуг.
        </legal-group-item-form>
        <legal-group-item-form>
          3.2. Организация обрабатывает персональные данные только при наличии
          хотя бы одного из следующих условий:
        </legal-group-item-form>
        <legal-group-item-form>
          - обработка персональных данных осуществляется с согласия субъекта
          персональных данных на обработку его персональных данных;
        </legal-group-item-form>
        <legal-group-item-form>
          - обработка персональных данных необходима для достижения целей,
          предусмотренных законом, для осуществления и выполнения возложенных
          законодательством Российской Федерации на оператора функций,
          полномочий и обязанностей;
        </legal-group-item-form>
        <legal-group-item-form>
          - обработка персональных данных необходима для осуществления прав и
          законных интересов Компании или третьих лиц либо для достижения
          общественно значимых целей при условии, что при этом не нарушаются
          права и свободы субъекта персональных данных;
        </legal-group-item-form>
        <legal-group-item-form>
          - осуществляется обработка персональных данных, доступ неограниченного
          круга лиц к которым предоставлен субъектом персональных данных либо по
          его просьбе;
        </legal-group-item-form>
        <legal-group-item-form>
          - осуществляется обработка персональных данных, подлежащих
          опубликованию или обязательному раскрытию в соответствии с федеральным
          законом.
        </legal-group-item-form>
        <legal-group-item-form>
          3.3. Организация и иные лица, получившие доступ к персональным данным,
          обязаны не раскрывать третьим лицам и не распространять персональные
          данные без согласия субъекта персональных данных, если иное не
          предусмотрено федеральным законом.
        </legal-group-item-form>
        <legal-group-item-form>
          3.4. Цели обработки персональных данных:
        </legal-group-item-form>
        <legal-group-item-form>
          - для идентификации субъекта персональных данных;
        </legal-group-item-form>
        <legal-group-item-form>
          - для осуществления возможности регистрации субъекта;
        </legal-group-item-form>
        <legal-group-item-form>
          - улучшение качества услуг, оказываемых Организацией;
        </legal-group-item-form>
        <legal-group-item-form>
          - для предоставления услуг и сервисов, размещенных на сайте
          www.light-town.space и предоставляемых Организацией.
        </legal-group-item-form>
        <legal-group-item-form>
          3.5. Обработка специальных категорий Персональных данных, касающихся
          расовой, национальной принадлежности, политических взглядов,
          религиозных или философских убеждений, интимной жизни, Организацией не
          осуществляется.
        </legal-group-item-form>
        <legal-group-item-form>
          3.6. Принципы обработки персональных данных:
        </legal-group-item-form>
        <legal-group-item-form>
          - законность целей и способов обработки персональных данных;
        </legal-group-item-form>
        <legal-group-item-form> - добросовестность; </legal-group-item-form>
        <legal-group-item-form>
          - соответствие состава и объема обрабатываемых персональных данных, а
          также способов обработки персональных данных заявленным целям
          обработки;
        </legal-group-item-form>
        <legal-group-item-form>
          - точность и достаточность, а в необходимых случаях и актуальность
          персональных данных по отношению к заявленным целям их обработки;
        </legal-group-item-form>
        <legal-group-item-form>
          - уничтожение персональных данных по достижении целей обработки
          способом, исключающим возможность их восстановления;
        </legal-group-item-form>
        <legal-group-item-form>
          - недопустимость объединения баз данных, содержащих персональные
          данные, обработка которых осуществляется в целях, несовместимых между
          собой.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form title="4. СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ">
        <legal-group-item-form>
          4.1. Сроки обработки персональных данных определяются исходя из целей
          обработки в информационных системах Организации, в соответствии со
          сроком действия договора, соглашения с Субъектом персональных данных.
        </legal-group-item-form>
        <legal-group-item-form>
          4.1.1. Обрабатываемые персональные данные подлежат уничтожению либо
          обезличиванию при наступлении следующий условий:
        </legal-group-item-form>
        <legal-group-item-form>
          - достижение целей обработки персональных данных или максимальных
          сроков хранения — подлежит уничтожению либо обезличиванию в течение 30
          дней;
        </legal-group-item-form>
        <legal-group-item-form>
          - утрата необходимости в достижении целей обработки персональных
          данных — в течение 30 дней;
        </legal-group-item-form>
        <legal-group-item-form>
          - предоставление субъектом персональных данных или его законным
          представителем подтверждения того, что персональные данные являются
          незаконно полученными или не являются необходимыми для заявленной цели
          обработки — в течение 7 дней;
        </legal-group-item-form>
        <legal-group-item-form>
          - отзыв субъектом персональных данных согласия на обработку
          персональных данных, если сохранение персональных данных более не
          требуется для целей обработки персональных данных — в течение 30 дней.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form
        title="5. КРУГ ЛИЦ ДОПУЩЕННЫХ К ОБРАБОТКЕ ПЕРСОНАЛЬНЫХ ДАННЫХ"
      >
        <legal-group-item-form>
          5.1. Для достижения целей статьи 3 настоящей Политики к обработке
          персональных данных допущены только те сотрудники Организации, на
          которых возложена такая обязанность в соответствии с их служебными
          (трудовыми) обязанностями. Доступ других сотрудников может быть
          предоставлен только в предусмотренных законом случаях. Организация
          требует от своих сотрудников соблюдения конфиденциальности и
          обеспечения безопасности персональных данных, при их обработке.
        </legal-group-item-form>
        <legal-group-item-form>
          5.2. Организация вправе передать персональные данные третьим лицам в
          следующих случаях:
        </legal-group-item-form>
        <legal-group-item-form>
          - Субъект персональных данных явно выразил свое согласие на такие
          действия;
        </legal-group-item-form>
        <legal-group-item-form>
          - Передача предусмотрена заключенным между Сторонами Договором,
          российским или иным применимым законодательством.
        </legal-group-item-form>
        <legal-group-item-form>
          При этом к приобретателю переходят все обязательства по соблюдению
          условий настоящей Политики применительно к полученным им данным.
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form
        title="6. ПОРЯДОК И МЕТОДЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ"
      >
        <legal-group-item-form
          >6.1. В процессе предоставления услуг, при осуществлении
          внутрихозяйственной деятельности Организация использует
          автоматизированную и неавтоматизированную обработку персональных
          данных.
        </legal-group-item-form>
        <legal-group-item-form>
          6.2. Организация вправе поручить Обработку Персональных данных другому
          лицу с согласия Субъекта Персональных данных, если иное не
          предусмотрено законодательством Российской Федерации, на основании
          заключаемого с этим лицом договора, обязательным условием которого
          является соблюдение этим лицом принципов и правил Обработки
          Персональных данных, предусмотренных Федеральным законом «О
          персональных данных».
        </legal-group-item-form>
        <legal-group-item-form>
          6.3. Персональные данные не раскрываются третьим лицам и не
          распространяются иным образом без согласия Субъекта Персональных
          данных, если иное не предусмотрено законодательством Российской
          Федерации или договором.
        </legal-group-item-form>
        <legal-group-item-form>
          6.4. В случае подтверждения факта неточности персональных данных или
          неправомерности их обработки, персональные данные подлежат их
          актуализации оператором, а обработка должна быть прекращена.
        </legal-group-item-form>
        <legal-group-item-form>
          6.5. Организация и Пользователь также обладают иными правами и несет
          иные обязанности, установленные Федеральным законом «О персональных
          данных».
        </legal-group-item-form>
      </legal-group-form>
      <legal-group-form title="7. РЕАЛИЗАЦИЯ ЗАЩИТЫ ПЕРСОНАЛЬНЫХ ДАННЫХ">
        <legal-group-item-form>
          7.1. Деятельность Организации по обработке персональных данных в
          информационных системах неразрывно связана с защитой Организацией
          конфиденциальности полученной информации. Все работники Организации
          обязаны обеспечивать конфиденциальность персональных данных, а также
          об иных сведениях, установленных Организацией, если это не
          противоречит действующему законодательству РФ.
        </legal-group-item-form>
        <legal-group-item-form>
          7.2. Обеспечение безопасности обрабатываемых персональных данных
          осуществляется Организацией в рамках единой комплексной системы
          организационно-технических и правовых мероприятий по защите
          информации, составляющей коммерческую тайну, с учетом требований
          законодательства о персональных данных, принятых в соответствии с ним
          нормативных правовых актов.
        </legal-group-item-form>
        <legal-group-item-form>
          7.3. Обмен персональными данными при их обработке в информационных
          системах осуществляется по каналам связи, защищенным техническими
          средства защиты информации.
        </legal-group-item-form>
        <legal-group-item-form>
          7.4. При обработке персональных данных в информационных системах
          Организации обеспечиваются:
        </legal-group-item-form>
        <legal-group-item-form>
          - проведение мероприятий, направленных на предотвращение
          несанкционированного доступа к персональным данным и (или) передача их
          лицам, не имеющим права доступа к такой информации;
        </legal-group-item-form>
        <legal-group-item-form>
          - своевременное обнаружение фактов несанкционированного доступа к
          персональным данным;
        </legal-group-item-form>
        <legal-group-item-form>
          - недопущение воздействия на технические средства автоматизированной
          обработки персональных данных, в результате которого может быть
          нарушено их функционирование;
        </legal-group-item-form>
        <legal-group-item-form>
          - возможность незамедлительного восстановления персональных данных,
          модифицированных и уничтоженных вследствие несанкционированного
          доступа к ним;
        </legal-group-item-form>
        <legal-group-item-form>
          - постоянный контроль уровня защищенности персональных данных;
        </legal-group-item-form>
        <legal-group-item-form>
          - назначение должностных лиц, ответственных за организацию обработки и
          защиты персональных данных;
        </legal-group-item-form>
        <legal-group-item-form>
          - ограничение состава лиц, имеющих доступ к персональным данным;
        </legal-group-item-form>
        <legal-group-item-form>
          - ознакомление субъектов с требованиями федерального законодательства
          и нормативных документов Организации по обработке и защите
          персональных данных;
        </legal-group-item-form>
        <legal-group-item-form>
          - производится ознакомление сотрудников Организации, осуществляющих
          обработку персональных данных, c требованиями законодательства РФ о
          персональных данных, локальными актами по вопросам обработки
          персональных данных.
        </legal-group-item-form>
      </legal-group-form>
    </legal-form>
  </auth-page-layout>
</template>

<script>
import AuthPageLayout from '~/layouts/auth/index.vue';
import LegalForm from '~/components/forms/legal/index.vue';
import LegalGroupForm from '~/components/forms/legal/group.vue';
import LegalGroupItemForm from '~/components/forms/legal/group-item.vue';

export default {
  name: 'PrivacyPage',
  components: {
    AuthPageLayout,
    LegalForm,
    LegalGroupForm,
    LegalGroupItemForm,
  },
};
</script>

<style lang="scss" src="./index.scss"></style>
